<a href="https://colab.research.google.com/github/kitakazex/-Saturday-course-Excel-automation/blob/master/%E5%9C%9F%E6%9B%9C%E6%97%A5%E8%AC%9B%E5%BA%A7%E3%80%80SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#◇段取り用関数

---

はじめにこちらを実行してください

##◇段取り用関数(CREATE用)

In [1]:
import re,sqlite3

In [2]:
def c_sql():
    con = sqlite3.connect('test.db')
    cur = con.cursor()
    s=re.sub('["\n","\s"]','',sql)
    s2=re.sub('\(.*?\).*','',s)
    tbl=re.sub('(create)+.*(table)','',s2, flags=re.IGNORECASE).strip()
    drop_sql=f"DROP TABLE IF EXISTS {tbl}"
    cur.execute(drop_sql)
    cur.execute(sql)
    
    print(f'【{tbl}】')
    attribute=cur.execute(f'PRAGMA table_info({tbl})')
    for a in attribute:
        print(a[1],end="｜")
    con.close()

##◇段取り用関数(DROP用)

In [3]:
def d_sql():
    con = sqlite3.connect('test.db')
    cur = con.cursor()
    try:
        cur.execute(sql)
        print(f'"{sql}"を実行しました。')
    except :
        print("存在しないテーブルは削除できません。\nテーブル削除に失敗しました。")
    con.close()

##◇段取り用関数(ALTER用)

In [4]:
def a_sql():
    con = sqlite3.connect('test.db')
    cur = con.cursor()

    s=re.sub('["\n","\s"]','',sql)
    judge=re.search('(rename)',s,flags=re.IGNORECASE)
    if judge:
        index=judge.span()
        tbl=re.sub('(rename)+.*to','',s[index[0]:], flags=re.IGNORECASE).strip()
    else:
        s2=re.sub('(add)+.*','',s, flags=re.IGNORECASE)
        tbl=re.sub('(alter)+.*table','',s2, flags=re.IGNORECASE).strip()
    try:
        cur.execute(sql)        
    except:
        pass

    print(f'【{tbl}】')
    attribute=cur.execute(f'PRAGMA table_info({tbl})')
    for a in attribute:
        print(a[1],end="｜")
    con.close()

##◇段取り用関数(SELECT用)

In [5]:
def ck_sql():
    con = sqlite3.connect("test.db")
    cur = con.cursor()
    cur.execute(sql)
    
    attribute=[d[0]+'|' for d in cur.description]
    print(*attribute)
    for row in cur.execute(sql):
        print(*row)
       
    con.close()

##◇段取り用関数（INSERT用）

In [6]:
#発注テーブルにデータを挿入する
def i_sql():
    con = sqlite3.connect('test.db')
    cur = con.cursor()
    
    s=re.sub('["\n","\s"]','',sql)
    s2=re.sub('\(.*?\).*','',s)

    tbl=re.sub('(insert)+.*(into)','',s2, flags=re.IGNORECASE).strip()

    cur.executemany(sql,data)
    con.commit()
    
    attribute=cur.execute(f'PRAGMA table_info({tbl})')
    print(f'【{tbl}】')

    for a in attribute:
        print(a[1],end="｜")
    print()
    for row in cur.execute(f"SELECT * FROM {tbl}"):
        print(*row)
    con.close()

#サンプルデータベース作成

---
学習用のサンプルデータベースを作成します。

##商品テーブルを作成する

In [7]:
sql=f"""CREATE  TABLE  商品テーブル( 
               商品id INTEGER PRIMARY KEY ,
               カテゴリ TEXT ,
               商品名 TEXT ,
               価格 INTEGER)"""
c_sql()

【商品テーブル】
商品id｜カテゴリ｜商品名｜価格｜

In [8]:
#商品テーブルにデータを挿入する
sql="INSERT INTO 商品テーブル(カテゴリ,商品名,価格) VALUES( ?, ?, ?)"
data=[
    ('書籍','SQLの本',2500),
    ('電化製品','アイロン',1200),
    ('衣類','セーター',2000),
    ('文房具','コンパス',300),
    ('食料品','食パン',150),
    ('書籍','Pythonの本',2500),
    ('電化製品','洗濯機',20000),
    ('衣類','シャツ',1000),
    ('食料品','お米',1250),
    ('電化製品','テレビ',23000),
    ('衣類','コート',30000),
    ('文房具','定規',200),
    ('食料品','北海道',2400),
    ('食料品','秋田米',4000),
    ('食料品','岩手米',3800),
    ('食料品','新潟米',2600),
    ('食料品','卵',180),
    ('書籍','C#の本',2800),
    ('電化製品','ドライヤー',3200),
    ('文房具','ノート',100),
    ('食料品','豆腐',100),
    ('書籍','JAVAの本',2600),
    ('電化製品','電気ポット',2200),
    ('文房具','ホチキス',300),
]

In [9]:
i_sql()

【商品テーブル】
商品id｜カテゴリ｜商品名｜価格｜
1 書籍 SQLの本 2500
2 電化製品 アイロン 1200
3 衣類 セーター 2000
4 文房具 コンパス 300
5 食料品 食パン 150
6 書籍 Pythonの本 2500
7 電化製品 洗濯機 20000
8 衣類 シャツ 1000
9 食料品 お米 1250
10 電化製品 テレビ 23000
11 衣類 コート 30000
12 文房具 定規 200
13 食料品 北海道 2400
14 食料品 秋田米 4000
15 食料品 岩手米 3800
16 食料品 新潟米 2600
17 食料品 卵 180
18 書籍 C#の本 2800
19 電化製品 ドライヤー 3200
20 文房具 ノート 100
21 食料品 豆腐 100
22 書籍 JAVAの本 2600
23 電化製品 電気ポット 2200
24 文房具 ホチキス 300

##発注テーブルを作成する

In [79]:
#発注テーブル作成

sql="""
        CREATE TABLE 発注テーブル( 
                              発注id INTEGER PRIMARY KEY ,
                              顧客名 TEXT ,
                              配送住所 TEXT ,
                              配送日 TEXT ,
                              商品id INTEGER  ,
                              FOREIGN KEY(商品id )
                                REFERENCES 商品テーブル(商品id) )"""
c_sql()

【発注テーブル】
発注id｜顧客名｜配送住所｜配送日｜商品id｜

In [82]:
#発注テーブルにデータを挿入する①
sql="INSERT INTO 発注テーブル(顧客名,配送住所,配送日,商品id) VALUES( ?, ?, ?, ?)"
data=[
    ('A氏','Q市','2022-11-11',5),
    ('D氏','S市','2022-11-11',2),
    ('R氏','X市','2022-11-11',1),
    ('O氏','L市','2022-11-12',3),
    ('K氏','C市','2022-11-12',4),
    ('A氏','Q市','2022-11-12',8),
    ('D氏','S市','2022-11-14',7),
    ('R氏','X市','2022-11-14',6),
    ('O氏','L市','2022-11-14',9),
    ('K氏','C市','2022-11-14',12),
    ('A氏','Q市','2022-11-13',14),
    ('D氏','S市','2022-11-13',10),
    ('R氏','X市','2022-11-16',11),
    ('O氏','L市','2022-11-16',13),
    ('K氏','C市','2022-11-16',15),
    ('R氏','X市','2022-11-17',16),
]

In [83]:
i_sql()

【発注テーブル】
発注id｜顧客名｜配送住所｜配送日｜商品id｜
1 A氏 Q市 2022-11-11 5
2 D氏 S市 2022-11-11 2
3 R氏 X市 2022-11-11 1
4 O氏 L市 2022-11-12 3
5 K氏 C市 2022-11-12 4
6 A氏 Q市 2022-11-12 8
7 D氏 S市 2022-11-14 7
8 R氏 X市 2022-11-14 6
9 O氏 L市 2022-11-14 9
10 K氏 C市 2022-11-14 12
11 A氏 Q市 2022-11-13 14
12 D氏 S市 2022-11-13 10
13 R氏 X市 2022-11-16 11
14 O氏 L市 2022-11-16 13
15 K氏 C市 2022-11-16 15
16 R氏 X市 2022-11-17 16

#CREATE

In [13]:
sql = """CREATE TABLE テストテーブル(
            主キーid INTEGER PRIMARYKEY,
            項目1 TEXT UNIQUE,
            項目2 TEXT NOT NULL
        )"""

c_sql()

【テストテーブル】
主キーid｜項目1｜項目2｜

#DROP

In [14]:
#テーブル削除
sql= "DROP TABLE テストテーブル"
d_sql()

"DROP TABLE テストテーブル"を実行しました。

In [15]:
#存在する場合のみテーブルを削除
sql= "DROP TABLE IF EXISTS テストテーブル"
d_sql()

"DROP TABLE IF EXISTS テストテーブル"を実行しました。

再びテストテーブルを作成します。

In [16]:
sql = """CREATE TABLE テストテーブル(
            主キーid INTEGER PRIMARYKEY,
            項目1 TEXT UNIQUE,
            項目2 TEXT NOT NULL
        )"""

c_sql()

【テストテーブル】
主キーid｜項目1｜項目2｜

#ALTER

In [17]:
#属性を追加する
sql= "ALTER TABLE テストテーブル ADD COLUMN 項目3 REAL"
a_sql()

【テストテーブル】
主キーid｜項目1｜項目2｜項目3｜

In [18]:
#テーブルの名前を変更する
sql="ALTER TABLE テストテーブル RENAME TO テストテーブル2"
a_sql()

【テストテーブル2】
主キーid｜項目1｜項目2｜項目3｜

#SELECT

In [21]:
sql = "SELECT * FROM 商品テーブル"
ck_sql()

商品id| カテゴリ| 商品名| 価格|
1 書籍 SQLの本 2500
2 電化製品 アイロン 1200
3 衣類 セーター 2000
4 文房具 コンパス 300
5 食料品 食パン 150
6 書籍 Pythonの本 2500
7 電化製品 洗濯機 20000
8 衣類 シャツ 1000
9 食料品 お米 1250
10 電化製品 テレビ 23000
11 衣類 コート 30000
12 文房具 定規 200
13 食料品 北海道 2400
14 食料品 秋田米 4000
15 食料品 岩手米 3800
16 食料品 新潟米 2600
17 食料品 卵 180
18 書籍 C#の本 2800
19 電化製品 ドライヤー 3200
20 文房具 ノート 100
21 食料品 豆腐 100
22 書籍 JAVAの本 2600
23 電化製品 電気ポット 2200
24 文房具 ホチキス 300

In [22]:
sql="SELECT COUNT(*) AS 個数 FROM 商品テーブル"
ck_sql()

個数|
24

In [23]:
sql="SELECT 商品名,価格 FROM 商品テーブル"
ck_sql()

商品名| 価格|
SQLの本 2500
アイロン 1200
セーター 2000
コンパス 300
食パン 150
Pythonの本 2500
洗濯機 20000
シャツ 1000
お米 1250
テレビ 23000
コート 30000
定規 200
北海道 2400
秋田米 4000
岩手米 3800
新潟米 2600
卵 180
C#の本 2800
ドライヤー 3200
ノート 100
豆腐 100
JAVAの本 2600
電気ポット 2200
ホチキス 300

In [24]:
sql="""SELECT * FROM 商品テーブル
        WHERE 価格>1000 OR 価格=1000"""
ck_sql()

商品id| カテゴリ| 商品名| 価格|
1 書籍 SQLの本 2500
2 電化製品 アイロン 1200
3 衣類 セーター 2000
6 書籍 Pythonの本 2500
7 電化製品 洗濯機 20000
8 衣類 シャツ 1000
9 食料品 お米 1250
10 電化製品 テレビ 23000
11 衣類 コート 30000
13 食料品 北海道 2400
14 食料品 秋田米 4000
15 食料品 岩手米 3800
16 食料品 新潟米 2600
18 書籍 C#の本 2800
19 電化製品 ドライヤー 3200
22 書籍 JAVAの本 2600
23 電化製品 電気ポット 2200

In [25]:
#計算式
sql="""SELECT 商品名,価格 ,CAST(価格*1.1 AS INT) AS 税込み価格 
        FROM 商品テーブル"""
ck_sql()

商品名| 価格| 税込み価格|
SQLの本 2500 2750
アイロン 1200 1320
セーター 2000 2200
コンパス 300 330
食パン 150 165
Pythonの本 2500 2750
洗濯機 20000 22000
シャツ 1000 1100
お米 1250 1375
テレビ 23000 25300
コート 30000 33000
定規 200 220
北海道 2400 2640
秋田米 4000 4400
岩手米 3800 4180
新潟米 2600 2860
卵 180 198
C#の本 2800 3080
ドライヤー 3200 3520
ノート 100 110
豆腐 100 110
JAVAの本 2600 2860
電気ポット 2200 2420
ホチキス 300 330

In [26]:
#属性同士を連結する
sql=r"""SELECT 商品名 || ' の価格は、\'|| 価格 || ' です。'AS 商品の価格
    FROM 商品テーブル """
ck_sql()

商品の価格|
SQLの本 の価格は、\2500 です。
アイロン の価格は、\1200 です。
セーター の価格は、\2000 です。
コンパス の価格は、\300 です。
食パン の価格は、\150 です。
Pythonの本 の価格は、\2500 です。
洗濯機 の価格は、\20000 です。
シャツ の価格は、\1000 です。
お米 の価格は、\1250 です。
テレビ の価格は、\23000 です。
コート の価格は、\30000 です。
定規 の価格は、\200 です。
北海道 の価格は、\2400 です。
秋田米 の価格は、\4000 です。
岩手米 の価格は、\3800 です。
新潟米 の価格は、\2600 です。
卵 の価格は、\180 です。
C#の本 の価格は、\2800 です。
ドライヤー の価格は、\3200 です。
ノート の価格は、\100 です。
豆腐 の価格は、\100 です。
JAVAの本 の価格は、\2600 です。
電気ポット の価格は、\2200 です。
ホチキス の価格は、\300 です。

In [27]:
#別名を指定する
sql="SELECT HT.* FROM 発注テーブル HT "
ck_sql()

発注id| 顧客名| 住所| 配送日| 商品id|
1 A氏 Q市 2022-11-11 5
2 D氏 S市 2022-11-11 2
3 R氏 X市 2022-11-11 1
4 O氏 L市 2022-11-12 3
5 K氏 C市 2022-11-12 4
6 A氏 Q市 2022-11-12 8
7 D氏 S市 2022-11-14 7
8 R氏 X市 2022-11-14 6
9 O氏 L市 2022-11-14 9
10 K氏 C市 2022-11-14 12
11 A氏 Q市 2022-11-13 14
12 D氏 S市 2022-11-13 10
13 R氏 X市 2022-11-16 11
14 O氏 L市 2022-11-16 13
15 K氏 C市 2022-11-16 15
16 R氏 X市 2022-11-17 16

##条件式

In [28]:
#条件式を使う
#範囲を検索する
sql="""SELECT * FROM 商品テーブル
        WHERE 価格 BETWEEN 1000 AND 2000"""
ck_sql()

商品id| カテゴリ| 商品名| 価格|
2 電化製品 アイロン 1200
3 衣類 セーター 2000
8 衣類 シャツ 1000
9 食料品 お米 1250

In [29]:
#条件式を使う
#等しいものを検索する
sql="""SELECT * FROM 商品テーブル
        WHERE カテゴリ IN ('書籍','文房具')"""
ck_sql()

商品id| カテゴリ| 商品名| 価格|
1 書籍 SQLの本 2500
4 文房具 コンパス 300
6 書籍 Pythonの本 2500
12 文房具 定規 200
18 書籍 C#の本 2800
20 文房具 ノート 100
22 書籍 JAVAの本 2600
24 文房具 ホチキス 300

In [30]:
#条件式を使う
#部分一致を検索する
sql="""SELECT * FROM 商品テーブル
        WHERE 商品名 LIKE '%米' """
ck_sql()

商品id| カテゴリ| 商品名| 価格|
9 食料品 お米 1250
14 食料品 秋田米 4000
15 食料品 岩手米 3800
16 食料品 新潟米 2600

In [31]:
#条件式を使う
#異なるものを検索する
sql="""SELECT * FROM 商品テーブル
        WHERE カテゴリ NOT IN('電化製品','書籍','食料品')"""
ck_sql()

商品id| カテゴリ| 商品名| 価格|
3 衣類 セーター 2000
4 文房具 コンパス 300
8 衣類 シャツ 1000
11 衣類 コート 30000
12 文房具 定規 200
20 文房具 ノート 100
24 文房具 ホチキス 300

##グループ化

GROUP BY句ではしばしば集約関数が共につかわれます。

In [ ]:
#AVG（属性）：平均
#MAX（属性）：最大値
#MIN（属性）：最小値
#SUM（属性）：合計
#COUNT(*)：個数
#COUNT(DISTINCT 属性)：重複しない個数

In [32]:
#グループ化する
#条件式無し①
sql="""SELECT カテゴリ,SUM(価格) AS カテゴリ別の合計価格 FROM 商品テーブル
        GROUP BY カテゴリ"""
ck_sql()

カテゴリ| カテゴリ別の合計価格|
文房具 900
書籍 10400
衣類 33000
電化製品 49600
食料品 14480

In [345]:
#グループ化する
#条件式無し②
sql="""SELECT カテゴリ,COUNT(*) || '点' AS カテゴリ別の品数 FROM 商品テーブル
        GROUP BY カテゴリ"""
ck_sql()

【商品テーブル】
商品id｜カテゴリ｜商品名｜価格｜
文房具 4点
書籍 4点
衣類 3点
電化製品 5点
食料品 8点

In [346]:
#グループ化する
#条件式あり
sql="""SELECT カテゴリ,価格 AS カテゴリ別の平均価格 FROM 商品テーブル
        GROUP BY カテゴリ
        HAVING カテゴリ IN ('文房具','食料品') """
ck_sql()

【商品テーブル】
商品id｜カテゴリ｜商品名｜価格｜
文房具 300
食料品 100

##並べ替え

In [33]:
#条件式なし:降順
sql="""SELECT * FROM 商品テーブル
        ORDER BY カテゴリ DESC"""
ck_sql()

商品id| カテゴリ| 商品名| 価格|
5 食料品 食パン 150
9 食料品 お米 1250
13 食料品 北海道 2400
14 食料品 秋田米 4000
15 食料品 岩手米 3800
16 食料品 新潟米 2600
17 食料品 卵 180
21 食料品 豆腐 100
2 電化製品 アイロン 1200
7 電化製品 洗濯機 20000
10 電化製品 テレビ 23000
19 電化製品 ドライヤー 3200
23 電化製品 電気ポット 2200
3 衣類 セーター 2000
8 衣類 シャツ 1000
11 衣類 コート 30000
1 書籍 SQLの本 2500
6 書籍 Pythonの本 2500
18 書籍 C#の本 2800
22 書籍 JAVAの本 2600
4 文房具 コンパス 300
12 文房具 定規 200
20 文房具 ノート 100
24 文房具 ホチキス 300

In [34]:
#条件式なし:昇順
sql="""SELECT * FROM 商品テーブル
        ORDER BY 価格 """ #ASC
ck_sql()

商品id| カテゴリ| 商品名| 価格|
20 文房具 ノート 100
21 食料品 豆腐 100
5 食料品 食パン 150
17 食料品 卵 180
12 文房具 定規 200
4 文房具 コンパス 300
24 文房具 ホチキス 300
8 衣類 シャツ 1000
2 電化製品 アイロン 1200
9 食料品 お米 1250
3 衣類 セーター 2000
23 電化製品 電気ポット 2200
13 食料品 北海道 2400
1 書籍 SQLの本 2500
6 書籍 Pythonの本 2500
16 食料品 新潟米 2600
22 書籍 JAVAの本 2600
18 書籍 C#の本 2800
19 電化製品 ドライヤー 3200
15 食料品 岩手米 3800
14 食料品 秋田米 4000
7 電化製品 洗濯機 20000
10 電化製品 テレビ 23000
11 衣類 コート 30000

##テーブルを結合する

###WHERE句で結合する

In [35]:
#基本
sql="""SELECT *
         FROM 発注テーブル,商品テーブル
         WHERE 発注テーブル.商品id=商品テーブル.商品id"""
ck_sql()

発注id| 顧客名| 住所| 配送日| 商品id| 商品id| カテゴリ| 商品名| 価格|
1 A氏 Q市 2022-11-11 5 5 食料品 食パン 150
2 D氏 S市 2022-11-11 2 2 電化製品 アイロン 1200
3 R氏 X市 2022-11-11 1 1 書籍 SQLの本 2500
4 O氏 L市 2022-11-12 3 3 衣類 セーター 2000
5 K氏 C市 2022-11-12 4 4 文房具 コンパス 300
6 A氏 Q市 2022-11-12 8 8 衣類 シャツ 1000
7 D氏 S市 2022-11-14 7 7 電化製品 洗濯機 20000
8 R氏 X市 2022-11-14 6 6 書籍 Pythonの本 2500
9 O氏 L市 2022-11-14 9 9 食料品 お米 1250
10 K氏 C市 2022-11-14 12 12 文房具 定規 200
11 A氏 Q市 2022-11-13 14 14 食料品 秋田米 4000
12 D氏 S市 2022-11-13 10 10 電化製品 テレビ 23000
13 R氏 X市 2022-11-16 11 11 衣類 コート 30000
14 O氏 L市 2022-11-16 13 13 食料品 北海道 2400
15 K氏 C市 2022-11-16 15 15 食料品 岩手米 3800
16 R氏 X市 2022-11-17 16 16 食料品 新潟米 2600

###JOIN句で結合する

####内部結合

In [36]:
#INNER JOIN ON
sql="""SELECT *
         FROM 発注テーブル INNER JOIN 商品テーブル
         ON 発注テーブル.商品id = 商品テーブル.商品id"""
ck_sql()

発注id| 顧客名| 住所| 配送日| 商品id| 商品id| カテゴリ| 商品名| 価格|
1 A氏 Q市 2022-11-11 5 5 食料品 食パン 150
2 D氏 S市 2022-11-11 2 2 電化製品 アイロン 1200
3 R氏 X市 2022-11-11 1 1 書籍 SQLの本 2500
4 O氏 L市 2022-11-12 3 3 衣類 セーター 2000
5 K氏 C市 2022-11-12 4 4 文房具 コンパス 300
6 A氏 Q市 2022-11-12 8 8 衣類 シャツ 1000
7 D氏 S市 2022-11-14 7 7 電化製品 洗濯機 20000
8 R氏 X市 2022-11-14 6 6 書籍 Pythonの本 2500
9 O氏 L市 2022-11-14 9 9 食料品 お米 1250
10 K氏 C市 2022-11-14 12 12 文房具 定規 200
11 A氏 Q市 2022-11-13 14 14 食料品 秋田米 4000
12 D氏 S市 2022-11-13 10 10 電化製品 テレビ 23000
13 R氏 X市 2022-11-16 11 11 衣類 コート 30000
14 O氏 L市 2022-11-16 13 13 食料品 北海道 2400
15 K氏 C市 2022-11-16 15 15 食料品 岩手米 3800
16 R氏 X市 2022-11-17 16 16 食料品 新潟米 2600

In [37]:
#INNER JOIN USING ←同じ名前の属性で結合する場合は'USING'が使えます。
sql="""SELECT *
         FROM 発注テーブル INNER JOIN 商品テーブル
         USING(商品id)"""
ck_sql()

発注id| 顧客名| 住所| 配送日| 商品id| カテゴリ| 商品名| 価格|
1 A氏 Q市 2022-11-11 5 食料品 食パン 150
2 D氏 S市 2022-11-11 2 電化製品 アイロン 1200
3 R氏 X市 2022-11-11 1 書籍 SQLの本 2500
4 O氏 L市 2022-11-12 3 衣類 セーター 2000
5 K氏 C市 2022-11-12 4 文房具 コンパス 300
6 A氏 Q市 2022-11-12 8 衣類 シャツ 1000
7 D氏 S市 2022-11-14 7 電化製品 洗濯機 20000
8 R氏 X市 2022-11-14 6 書籍 Pythonの本 2500
9 O氏 L市 2022-11-14 9 食料品 お米 1250
10 K氏 C市 2022-11-14 12 文房具 定規 200
11 A氏 Q市 2022-11-13 14 食料品 秋田米 4000
12 D氏 S市 2022-11-13 10 電化製品 テレビ 23000
13 R氏 X市 2022-11-16 11 衣類 コート 30000
14 O氏 L市 2022-11-16 13 食料品 北海道 2400
15 K氏 C市 2022-11-16 15 食料品 岩手米 3800
16 R氏 X市 2022-11-17 16 食料品 新潟米 2600

####外部結合

In [38]:
#左外部結合
sql="""SELECT *
         FROM 発注テーブル LEFT OUTER JOIN 商品テーブル
         ON 発注テーブル.商品id = 商品テーブル.商品id"""
ck_sql()

発注id| 顧客名| 住所| 配送日| 商品id| 商品id| カテゴリ| 商品名| 価格|
1 A氏 Q市 2022-11-11 5 5 食料品 食パン 150
2 D氏 S市 2022-11-11 2 2 電化製品 アイロン 1200
3 R氏 X市 2022-11-11 1 1 書籍 SQLの本 2500
4 O氏 L市 2022-11-12 3 3 衣類 セーター 2000
5 K氏 C市 2022-11-12 4 4 文房具 コンパス 300
6 A氏 Q市 2022-11-12 8 8 衣類 シャツ 1000
7 D氏 S市 2022-11-14 7 7 電化製品 洗濯機 20000
8 R氏 X市 2022-11-14 6 6 書籍 Pythonの本 2500
9 O氏 L市 2022-11-14 9 9 食料品 お米 1250
10 K氏 C市 2022-11-14 12 12 文房具 定規 200
11 A氏 Q市 2022-11-13 14 14 食料品 秋田米 4000
12 D氏 S市 2022-11-13 10 10 電化製品 テレビ 23000
13 R氏 X市 2022-11-16 11 11 衣類 コート 30000
14 O氏 L市 2022-11-16 13 13 食料品 北海道 2400
15 K氏 C市 2022-11-16 15 15 食料品 岩手米 3800
16 R氏 X市 2022-11-17 16 16 食料品 新潟米 2600

In [39]:
#左外部結合 商品テーブル（左）発注テーブル（右）の時
sql="""SELECT *
         FROM 商品テーブル LEFT OUTER JOIN 発注テーブル
         ON 発注テーブル.商品id = 商品テーブル.商品id"""
ck_sql()

商品id| カテゴリ| 商品名| 価格| 発注id| 顧客名| 住所| 配送日| 商品id|
1 書籍 SQLの本 2500 3 R氏 X市 2022-11-11 1
2 電化製品 アイロン 1200 2 D氏 S市 2022-11-11 2
3 衣類 セーター 2000 4 O氏 L市 2022-11-12 3
4 文房具 コンパス 300 5 K氏 C市 2022-11-12 4
5 食料品 食パン 150 1 A氏 Q市 2022-11-11 5
6 書籍 Pythonの本 2500 8 R氏 X市 2022-11-14 6
7 電化製品 洗濯機 20000 7 D氏 S市 2022-11-14 7
8 衣類 シャツ 1000 6 A氏 Q市 2022-11-12 8
9 食料品 お米 1250 9 O氏 L市 2022-11-14 9
10 電化製品 テレビ 23000 12 D氏 S市 2022-11-13 10
11 衣類 コート 30000 13 R氏 X市 2022-11-16 11
12 文房具 定規 200 10 K氏 C市 2022-11-14 12
13 食料品 北海道 2400 14 O氏 L市 2022-11-16 13
14 食料品 秋田米 4000 11 A氏 Q市 2022-11-13 14
15 食料品 岩手米 3800 15 K氏 C市 2022-11-16 15
16 食料品 新潟米 2600 16 R氏 X市 2022-11-17 16
17 食料品 卵 180 None None None None None
18 書籍 C#の本 2800 None None None None None
19 電化製品 ドライヤー 3200 None None None None None
20 文房具 ノート 100 None None None None None
21 食料品 豆腐 100 None None None None None
22 書籍 JAVAの本 2600 None None None None None
23 電化製品 電気ポット 2200 None None None None None
24 文房具 ホチキス 300 None None None None None

In [ ]:
#右外部結合→sqlite3で右外部結合と全外部結合は未対応です。

In [40]:
#自然結合
sql="""SELECT *
 FROM 発注テーブル NATURAL INNER JOIN  商品テーブル"""
ck_sql()

発注id| 顧客名| 住所| 配送日| 商品id| カテゴリ| 商品名| 価格|
1 A氏 Q市 2022-11-11 5 食料品 食パン 150
2 D氏 S市 2022-11-11 2 電化製品 アイロン 1200
3 R氏 X市 2022-11-11 1 書籍 SQLの本 2500
4 O氏 L市 2022-11-12 3 衣類 セーター 2000
5 K氏 C市 2022-11-12 4 文房具 コンパス 300
6 A氏 Q市 2022-11-12 8 衣類 シャツ 1000
7 D氏 S市 2022-11-14 7 電化製品 洗濯機 20000
8 R氏 X市 2022-11-14 6 書籍 Pythonの本 2500
9 O氏 L市 2022-11-14 9 食料品 お米 1250
10 K氏 C市 2022-11-14 12 文房具 定規 200
11 A氏 Q市 2022-11-13 14 食料品 秋田米 4000
12 D氏 S市 2022-11-13 10 電化製品 テレビ 23000
13 R氏 X市 2022-11-16 11 衣類 コート 30000
14 O氏 L市 2022-11-16 13 食料品 北海道 2400
15 K氏 C市 2022-11-16 15 食料品 岩手米 3800
16 R氏 X市 2022-11-17 16 食料品 新潟米 2600

###和・差・直積・積で結合する

###商品テーブル2を作成する

In [47]:
#商品テーブル2を作成する

sql=f"""CREATE  TABLE  商品テーブル2( 
               商品id INTEGER PRIMARY KEY ,
               カテゴリ TEXT ,
               商品名 TEXT ,
               価格 INTEGER)"""
c_sql()

【商品テーブル2】
商品id｜カテゴリ｜商品名｜価格｜

In [48]:
#商品テーブル2にデータを挿入する
sql="INSERT INTO 商品テーブル2(カテゴリ,商品名,価格) VALUES( ?, ?, ?)"
data=[
    ('書籍','SQLの本',2500),
    ('電化製品','アイロン',1200),
    ('衣類','セーター',2000),
    ('文房具','コンパス',300),
    ('食料品','食パン',150),
    ('書籍','Pythonの本',2500),
    ('電化製品','洗濯機',20000),
    ('衣類','シャツ',1000),
    ('食料品','お米',1250),
    ('電化製品','テレビ',23000),
    ('衣類','コート',30000),
    ('書籍','C++の本',2500),
    ('電化製品','冷蔵庫',20000),
    ('衣類','ジャンバー',3000),
    ('文房具','蛍光ペン',80),
    ('食料品','ふりかけ',180),
    ('書籍','機械学習の本',2500),
    ('電化製品','掃除機',8000),
    ('書籍','Pythonの本',2500),
    ('電化製品','洗濯機',20000),
    ('衣類','シャツ',1000),
    ('食料品','お米',1250),
    ('電化製品','テレビ',23000),
    ('衣類','半袖シャツ',1000),
    ('食料品','大根',150),
    ('電化製品','炊飯器',4000),
    ('衣類','電子レンジ',22000),
    ('文房具','クリップ',100),
]

In [49]:
i_sql()

【商品テーブル2】
商品id｜カテゴリ｜商品名｜価格｜
1 書籍 SQLの本 2500
2 電化製品 アイロン 1200
3 衣類 セーター 2000
4 文房具 コンパス 300
5 食料品 食パン 150
6 書籍 Pythonの本 2500
7 電化製品 洗濯機 20000
8 衣類 シャツ 1000
9 食料品 お米 1250
10 電化製品 テレビ 23000
11 衣類 コート 30000
12 書籍 C++の本 2500
13 電化製品 冷蔵庫 20000
14 衣類 ジャンバー 3000
15 文房具 蛍光ペン 80
16 食料品 ふりかけ 180
17 書籍 機械学習の本 2500
18 電化製品 掃除機 8000
19 書籍 Pythonの本 2500
20 電化製品 洗濯機 20000
21 衣類 シャツ 1000
22 食料品 お米 1250
23 電化製品 テレビ 23000
24 衣類 半袖シャツ 1000
25 食料品 大根 150
26 電化製品 炊飯器 4000
27 衣類 電子レンジ 22000
28 文房具 クリップ 100

###和

In [ ]:
#重複無し
sql=r"""SELECT 商品名,価格 FROM 商品テーブル
UNION 
SELECT 商品名,価格 FROM 商品テーブル2"""
ck_sql()

In [57]:

sql=f"SELECT  COUNT(*) FROM ({sql})"
ck_sql()

COUNT(*)|
36

In [ ]:
#重複あり
sql="""SELECT 商品名,価格  FROM 商品テーブル
UNION ALL
SELECT 商品名,価格 FROM 商品テーブル2"""
ck_sql()

In [67]:
s=sql
sql=f" SELECT COUNT(*) FROM ({s})"
ck_sql()

COUNT(*)|
52

###差

In [68]:
#商品テーブル-商品テーブル2
sql="""SELECT 商品名,価格  FROM 商品テーブル
EXCEPT
SELECT 商品名,価格  FROM 商品テーブル2"""
print("【商品テーブルにあって商品テーブル2に無いもの】\n")
ck_sql()

【商品テーブルにあって商品テーブル2に無いもの】

商品名| 価格|
C#の本 2800
JAVAの本 2600
ドライヤー 3200
ノート 100
ホチキス 300
北海道 2400
卵 180
定規 200
岩手米 3800
新潟米 2600
秋田米 4000
豆腐 100
電気ポット 2200

###テストテーブル作成

####テストテーブル１を作成

In [69]:
sql="CREATE TABLE テストテーブル1 (項目1 TEXT,項目2 TEXT,項目3 TEXT)"
c_sql()

【テストテーブル1】
項目1｜項目2｜項目3｜

In [71]:
sql="INSERT INTO テストテーブル1(項目1,項目2,項目3) VALUES(?,?,?)"
data=[("a","あ","ア"),
      ("b","い","イ"),
      ("c","う","ウ")]
i_sql()

【テストテーブル1】
項目1｜項目2｜項目3｜
a あ ア
b い イ
c う ウ

####テストテーブル２を作成

In [74]:
sql="""CREATE TABLE テストテーブル2(項目1 TEXT,項目2 TEXT,項目3 TEXT)"""
c_sql()

【テストテーブル2】
項目1｜項目2｜項目3｜

In [76]:
sql="INSERT INTO テストテーブル2(項目1,項目2,項目3) VALUES(?,?,?)"
data=[("a","あ","ア"),
      ("c","う","ウ"),
      ("d","え","エ")]    
i_sql()

【テストテーブル2】
項目1｜項目2｜項目3｜
a あ ア
c う ウ
d え エ

###直積

In [77]:
sql="""SELECT * FROM テストテーブル1
CROSS JOIN  テストテーブル2"""
ck_sql()

項目1| 項目2| 項目3| 項目1| 項目2| 項目3|
a あ ア a あ ア
a あ ア c う ウ
a あ ア d え エ
b い イ a あ ア
b い イ c う ウ
b い イ d え エ
c う ウ a あ ア
c う ウ c う ウ
c う ウ d え エ

###積

In [78]:
sql="""SELECT * FROM テストテーブル1
INTERSECT
SELECT * FROM テストテーブル2"""
ck_sql()

項目1| 項目2| 項目3|
a あ ア
c う ウ

##副問い合わせをする

In [ ]:
sql="""SELECT 　　商品名

##csv読み込み練習

In [ ]:
import csv
data=[]
with open('/content/hibakusha.csv') as f:
    reader= csv.reader(f)
    for line in reader:
        print(line)
        data.append(tuple(line))

['\ufeff性別', '年齢', '被爆者数', '調査対象者数', '回答者数', '回収率']
['男', '７０歳以下', '7,392', '2,240', '1,535', '0.685']
['男', '７１歳～８０歳', '32,011', '9,601', '7,586', '0.79']
['男', '８１歳～９０歳', '26,784', '7,998', '6,054', '0.757']
['男', '９１歳以上', '2,741', '849', '587', '0.691']
['女', '７０歳以下', '8,206', '2,483', '1,679', '0.676']
['女', '７１歳～８０歳', '41,029', '12,270', '9,323', '0.76']
['女', '８１歳～９０歳', '45,997', '13,768', '9,496', '0.69']
['女', '９１歳以上', '12,094', '3,614', '2,393', '0.662']

In [ ]:
import sqlite3
con = sqlite3.connect('hibakusha.db')
cur = con.cursor()

cur.execute('DROP TABLE IF EXISTS seibetu_nenreibetu')
cur.execute("""CREATE TABLE seibetu_nenreibetu(性別 TEXT, 
                                               年齢 TEXT,
                                               被爆者数 INTEGER,
                                               調査対象者 INTEGER,
                                               回答者数 INTEGER,
                                               回収率 REAL) """)
con.commit()
con.close()

In [ ]:
con = sqlite3.connect('hibakusha.db')
cur = con.cursor()
query = """INSERT INTO  seibetu_nenreibetu(性別,年齢,被爆者数,調査対象者,回答者数,回収率)
               VALUES(?,?,?,?,?,?)"""
cur.executemany(query,data)
con.commit()
for row in cur.execute("SELECT * FROM seibetu_nenreibetu"):
    print(row)
con.close()

('\ufeff性別', '年齢', '被爆者数', '調査対象者数', '回答者数', '回収率')
('男', '７０歳以下', '7,392', '2,240', '1,535', 0.685)
('男', '７１歳～８０歳', '32,011', '9,601', '7,586', 0.79)
('男', '８１歳～９０歳', '26,784', '7,998', '6,054', 0.757)
('男', '９１歳以上', '2,741', 849, 587, 0.691)
('女', '７０歳以下', '8,206', '2,483', '1,679', 0.676)
('女', '７１歳～８０歳', '41,029', '12,270', '9,323', 0.76)
('女', '８１歳～９０歳', '45,997', '13,768', '9,496', 0.69)
('女', '９１歳以上', '12,094', '3,614', '2,393', 0.662)

In [ ]:
#データベースを削除する
con = sqlite3.connect('hibakusha.db')
cur = con.cursor()
cur.execute("DROP TABLE IF EXISTS seibetu_nenreibetu")
con.close()

# バックアップ

In [46]:
#テーブルを削除
tbl="商品テーブル2"
sql=f"DROP TABLE {tbl}"
d_sql()

"DROP TABLE 商品テーブル2"を実行しました。